app/views/clientes/show.html.erb

SELECT "pets".* FROM "pets" WHERE "pets"."cliente_id" = ?  [["cliente_id", 1]]
---
  <tbody>
<% @cliente.pets.each do |pets|%>